# DataFrames:

In [3]:
import pandas as pd
import numpy as np

### create DataFrames using dict

In [4]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

df = pd.DataFrame(data) # creates dataframe from a dictonary
print(df)

# no of rows are knwn as samle size
# columns known as featers

print("\nShape of the DataFrame: ",df.shape) 
print("\nSIze of the DataFrame: ",df.size) 
print("\nOther important info about the DataFrame: \n") 
df.info()  # call this function to get all the information about data frames

# perform some standrad operation on the df and gives a basic idea about the df
print("\n described data frame:")
df.describe()
# checks only those columns which as int or float dataype

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

Shape of the DataFrame:  (6, 4)

SIze of the DataFrame:  24

Other important info about the DataFrame:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

 described data frame:

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

### .head() & .tail()
   to get n elements from start or end

In [5]:
print("From start:\n\n", df.head(2))  # .head(n) gives first rows from the start
print("\nFrom end:\n\n", df.tail(3))  # .tail(n) gives last rows from the last

From start:

     Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

From end:

     Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

### .loc[ ] and .iloc[ ]
to get a particular rows or columns

In [6]:
print("Elements from indes 1 to 3: ")
print(df.iloc[1:4])  # returns desiered rows with all columns
# to get both desired rows and column using iloc[]
print("\nSalarys of the Employees: ")
print(df.iloc[1:4, 3:]) 

print("\nNames and Age of the Employees: ")
# in loc[] two parameters can be passed one for the rows and second one for the columns
print(df.loc[1:3, ["Name", "Age"]])  # returns desired rows and also desired columns

Elements from indes 1 to 3:
      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

Salarys of the Employees:
    Salary
1  60000.0
2  70000.0
3  62000.0

Names and Age of the Employees:
      Name   Age
1      Bob  30.0
2  Charlie  35.0
3    David   NaN

### .drop()
to remove an entire row or column from DataFrame

In [7]:
# axis 1 for column 0 for rows
# this removed entire age column from df
print(df.drop("Age", axis=1, inplace=False))  # this returns a coppy of our origional df
# inplace=False set it true if want to change origional df by default its false

print("\n", df)  # here age is still in data beause that was just a coppy

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

       Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

### Brodcasting in Pandas

In [8]:
# lets increase the salarys of all employee by 5000

print("Original Salary: \n", df["Salary"])

df["Salary"] = df["Salary"] + 5000
# it updates in the origional dataframe made no coppys
# this adds 5000 in everyones salary like an loop

print("\nUpdated Salary: \n", df["Salary"])

Original Salary:
 0    50000.0
1    60000.0
2    70000.0
3    62000.0
4        NaN
5    50000.0
Name: Salary, dtype: float64

Updated Salary:
 0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

### Renaming columns

In [9]:
# lets change a name of the column   Department to Dept

df.rename(columns={"Department": "Dept"}, inplace=True)
# we added inplace=True so it changes in the main df instead of amking a copy
print(df) # here Department changed into Dept

      Name   Age     Dept   Salary
0    Alice  25.0       HR  55000.0
1      Bob  30.0       IT  65000.0
2  Charlie  35.0  Finance  75000.0
3    David   NaN       IT  67000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  55000.0

### .unique()
to find the unique values

In [10]:
print("Departments in office: ", df["Dept"].unique())
# returns only the unique values ignores dublicate values

Departments in office:  ['HR' 'IT' 'Finance']

### .value_count()
distribution of one particular column across the data set

In [11]:
print("People working across all departments:\n",df["Dept"].value_counts()) 
# counts all rows in Dept column and returns their counts

People working across all departments:
 Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

### create a new column

In [25]:
# lets pramote our emplyess and increase their salary 2 times in a new column

df["Promoted salary"] = df["Salary"] * 2
print("\n New Data frame: \n")
df  # here a new column is created with promoted salary

 New Data frame:

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1      Bob  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0         150000.0
3    David   NaN       IT  67000.0         134000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         110000.0

## Data cleaning

In [24]:
print("No of null values in each column: ")
print(df.isnull().sum())

df.dropna(how="all" )
# .dropna() has two methods to clean null values 
# 1. any deletes an entire row if he just found a single null value by default it set on any
# 2. all deltets the row when all the values are null otherwise it remains untouched
# Note: we need to use inplace=True in order to change in origional df otherwise it returns a coppy

No of null values in each column:
Name               0
Age                1
Dept               0
Salary             1
Promoted salary    1
dtype: int64

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1      Bob  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0         150000.0
3    David   NaN       IT  67000.0         134000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  55000.0         110000.0

### Filling data in nulll values

In [32]:
print("Age column after filling null values: ")
print(df["Age"].fillna(df["Age"].mean()))
# in this line we said fil the null values of age column to the average value of age column
# use inplace = True to change in origional data set

print("\nSalary column after filling null values: ")
print(df["Salary"].fillna(df["Salary"].median()))

print("\nPromoted salary column after filling null values: ")
print(df["Promoted salary"].fillna(df["Promoted salary"].median()))

Age column after filling null values:
0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

Salary column after filling null values:
0    55000.0
1    65000.0
2    75000.0
3    67000.0
4    65000.0
5    55000.0
Name: Salary, dtype: float64

Promoted salary column after filling null values:
0    110000.0
1    130000.0
2    150000.0
3    134000.0
4    130000.0
5    110000.0
Name: Promoted salary, dtype: float64

ffill( )   & bfill()

In [ ]:
print(df["Age"].ffill()) # it fills the missing value with its previous row value in the same column
print(df["Age"].bfill()) # it fills the missing value with its safter row value in the same column

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64
0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

### Replace a value in a column or row

In [53]:
print("Origional df: ")
print(df)

# lets change Bob's name to Sentry
df["Name"]=df["Name"].replace("Bob","Sentry")
# here you can see Bob changed into sentry
# beause we set df['Name'] = replaced name it also changed int he origional df

print("\n Changet df:")
df

Origional df:
      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1   Sentry  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0         150000.0
3    David   NaN       IT  67000.0         134000.0
4      Eve  29.0       HR      NaN              NaN

 Changet df:

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1   Sentry  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0         150000.0
3    David   NaN       IT  67000.0         134000.0
4      Eve  29.0       HR      NaN              NaN

### Dealing with Dublicate values

In [52]:
print("dublicate rows: \n",df[df.duplicated()])

# delete the dublicate rouw
df = df.drop_duplicates()
print("\nDf with no dublicate vaalues: ")
df

dublicate rows:
 Empty DataFrame
Columns: [Name, Age, Dept, Salary, Promoted salary]
Index: []

Df with no dublicate vaalues:

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1   Sentry  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0         150000.0
3    David   NaN       IT  67000.0         134000.0
4      Eve  29.0       HR      NaN              NaN

### Deal with invalid values in a column 
using lambda finction

In [59]:
# for example
# lets just devide the promoted salarys by 2 which are grater than 130000

df["Promoted salary"] = df["Promoted salary"].apply(
    lambda x: x / 2 if x > 130000 else x
)
# as you can see two values in index 2 and 3 are grater than 130000 so the get devided by 2
# we can also use any function instead of lambda inside .apply()
df

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1   Sentry  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0          75000.0
3    David   NaN       IT  67000.0          67000.0
4      Eve  29.0       HR      NaN              NaN

## Joint and Merge

In [ ]:
# lets take an another data set to understand this topic
department_info = {
    "Department": ["HR", "IT", "Finance"],
    "Location": ["New York", "San Francisco", "Chicago"],
    "Manager": ["Laura", "Steve", "Nina"],
}
df2 = pd.DataFrame(department_info)
print(df)  # our first data
df2  # second data

      Name   Age     Dept   Salary  Promoted salary
0    Alice  25.0       HR  55000.0         110000.0
1   Sentry  30.0       IT  65000.0         130000.0
2  Charlie  35.0  Finance  75000.0          75000.0
3    David   NaN       IT  67000.0          67000.0
4      Eve  29.0       HR      NaN              NaN

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

#### concat()

In [ ]:
pd.concat([df,df2])
# combines alll data horizontly row wise
# set all missing values from both the data sets to null

,Name,Age,Dept,Salary,Promoted salary,Department,Location,Manager
0,Alice,25.0,HR,55000.0,110000.0,NaN,NaN,NaN
1,Sentry,30.0,IT,65000.0,130000.0,NaN,NaN,NaN
2,Charlie,35.0,Finance,75000.0,75000.0,NaN,NaN,NaN
3,David,NaN,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,HR,New York,Laura
1,NaN,NaN,NaN,NaN,NaN,IT,San Francisco,Steve
2,NaN,NaN,NaN,NaN,NaN,Finance,Chicago,Nina

In [ ]:
pd.concat([df,df2],axis=1)
# combines alll data verticully or column wise

,Name,Age,Dept,Salary,Promoted salary,Department,Location,Manager
0,Alice,25.0,HR,55000.0,110000.0,HR,New York,Laura
1,Sentry,30.0,IT,65000.0,130000.0,IT,San Francisco,Steve
2,Charlie,35.0,Finance,75000.0,75000.0,Finance,Chicago,Nina
3,David,NaN,IT,67000.0,67000.0,NaN,NaN,NaN
4,Eve,29.0,HR,NaN,NaN,NaN,NaN,NaN

#### merge()

In [70]:
df2.rename(columns={"Department": "Dept"}, inplace=True)
# we use merge by taking refernce of a common column from both the data sets
merged_df = pd.merge(df, df2, on="Dept")
merged_df

      Name   Age     Dept   Salary  Promoted salary       Location Manager
0    Alice  25.0       HR  55000.0         110000.0       New York   Laura
1   Sentry  30.0       IT  65000.0         130000.0  San Francisco   Steve
2  Charlie  35.0  Finance  75000.0          75000.0        Chicago    Nina
3    David   NaN       IT  67000.0          67000.0  San Francisco   Steve
4      Eve  29.0       HR      NaN              NaN       New York   Laura